Конфигурация/Documents/ЗаявкаПайщика.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Document>
		<Properties>
			<Name>ЗаявкаПайщика</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗадолженностиПоПрочимАктивам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФонд</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыЗаявокПайщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерЗаявки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>24</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиАнкетИЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Агент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пайщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПайщика</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПайщиков</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НоминальныеДержатели</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Владелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчетаДепоВладельца</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНаСчетеДепоВладельца</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрытьЗакрытьДепозитарныйСчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитарныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетныйСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БИК</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеБанка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоррСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПолучательПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИННПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеПлатежа</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СозданДокументом</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СобственностьНаПаи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыСобственности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Многократная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСуммы</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиКоличество</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПЭП_НомерТелефона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПЭП_Код</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПЭП_ДатаВремяПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПаевойИнвестиционныйФондДляОбменаПаев</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПаевыеИнвестиционныеФонды</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДепозитарныйСчетВПаевомИнвестиционномФондеДляОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДепозитарныеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОткрытьДепозитарныйСчетВПаевомИнвестиционномФондеДляОбмена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИОАгента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДолжностьАгента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗаявкаНаОбмен</Name>
					<Comment>Заполняется, если в ЛКК единая заявка на обмен паев и приобретение во втором фонде</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаПайщика</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыгружатьОперацииВЕСИАФинанс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Представители</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Представитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВЛице</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеПолномочий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеПолномочийВЛице</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Имущество</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидИмущества</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыАктивов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Имущество</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыНедвижимости</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ЦенныеБумагиСумма</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Конфигурация/Enums/ИсточникиАнкетИЗаявок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ИсточникиАнкетИЗаявок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Агент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Офис</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Сайт</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыЗаявокПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЗаявокПайщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зачисление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Погашение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обмен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыПайщиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыПайщиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Владелец</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоверительныйУправляющий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НоминальныйДержатель</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Enums/ВидыЮрФизЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Enum>
		<Properties>
			<Name>ВидыЮрФизЛиц</Name>
			<Comment>Определяет, является ли организация или контрагент юридическим лицом или нет.</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФизическоеЛицо</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Конфигурация/Documents/ЗаявкаПайщика/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область События_формы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПриЧтенииСозданииНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УниверсальныеМеханизмы.ПриСозданииФормыНаСервере(ЭтотОбъект);
	
	Если Объект.Ссылка.Пустая() Тогда
		ПриЧтенииСозданииНаСервере();
	КонецЕсли;
	
	Для каждого ЗначениеПеречисления из Перечисления.ИсточникиАнкетИЗаявок Цикл
		Элементы.ИсточникЗаявки.СписокВыбора.Добавить(ЗначениеПеречисления);
	КонецЦикла;

	Для каждого ЗначениеПеречисления из Перечисления.ВидыЗаявокПайщиков Цикл
		Элементы.ВидЗаявки.СписокВыбора.Добавить(ЗначениеПеречисления);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииСозданииНаСервере()
	
	УстановитьДоступныеВидыПайщиков(Объект, ЭтотОбъект);
	УстановитьДоступныеВидыСобственности(Объект, ЭтотОбъект);
	НастроитьВидимостьИДоступность(Объект, ЭтотОбъект);
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка",
		Справочники.УправляющиеКомпании.ПолучитьПИФыПоЮрФизЛицуУправляющейКомпании(Объект.Дата, Объект.Организация.ЮрФизЛицо)));
	
	Элементы.ПаевойИнвестиционныйФонд.ПараметрыВыбора				= Новый ФиксированныйМассив(МассивПараметров);
	Элементы.ПаевойИнвестиционныйФондДляОбменаПаев.ПараметрыВыбора	= Новый ФиксированныйМассив(МассивПараметров);
	
	ЗаполнитьРеквизитыПлатежа(Объект, ЭтотОбъект);
	
	КоличествоПодчиненных = Элементы.ГруппаУчастники.ПодчиненныеЭлементы.Количество();
	Для Сч = 1 По КоличествоПодчиненных Цикл
		Элементы.Удалить(Элементы.ГруппаУчастники.ПодчиненныеЭлементы[КоличествоПодчиненных - Сч]);	
	КонецЦикла; 
	
	Для каждого СтрокаУчастник из Объект.Представители Цикл
		РазместитьУчастникаНаСервере(СтрокаУчастник.НомерСтроки - 1);
		УстановитьВидимостьРеквизитовУчастников(Элементы, СтрокаУчастник.Представитель, Формат(СтрокаУчастник.НомерСтроки - 1, "ЧН=0; ЧГ="));	
	КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ИсточникВыбора) = Тип("УправляемаяФорма") Тогда
		ЗаполнитьЗначенияСвойств(Объект, ВыбранноеЗначение);
		ЗаполнитьРеквизитыПлатежа(Объект, ЭтотОбъект);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Настройка_формы

&НаКлиентеНаСервереБезКонтекста
Процедура НастроитьВидимостьИДоступность(Объект, Форма)
	
	Элементы = Форма.Элементы;
	
	ВидимостьАгента = (Объект.ИсточникЗаявки = ПредопределенноеЗначение("Перечисление.ИсточникиАнкетИЗаявок.Агент"));
	
	Элементы.Агент.Видимость = ВидимостьАгента;
	Элементы.ФИОАгента.Видимость = ВидимостьАгента;
	Элементы.ДолжностьАгента.Видимость = ВидимостьАгента;
	
	ВидимостьБрокеров = (Объект.ВидПайщика = ПредопределенноеЗначение("Перечисление.ВидыПайщиков.НоминальныйДержатель"));
	
	Элементы.НоминальныеДержатели.Видимость = ВидимостьБрокеров;
	
	ВидимостьВладельца = (Объект.ВидПайщика <> ПредопределенноеЗначение("Перечисление.ВидыПайщиков.Владелец"));
	Элементы.ГруппаВладелец.Видимость = ВидимостьВладельца;
	
	Элементы.СтраницаИмущество.Видимость = Не Объект.Многократная 
		И Объект.ВидЗаявки = ПредопределенноеЗначение("Перечисление.ВидыЗаявокПайщиков.Зачисление");
		
	ЭтоЗаявкаНаОбмен = Объект.ВидЗаявки = ПредопределенноеЗначение("Перечисление.ВидыЗаявокПайщиков.Обмен");
	
	Элементы.ПаевойИнвестиционныйФондДляОбменаПаев.Видимость						= ЭтоЗаявкаНаОбмен;
	Элементы.ОткрытьДепозитарныйСчетВПаевомИнвестиционномФондеДляОбмена.Видимость	= ЭтоЗаявкаНаОбмен;
	Элементы.ДепозитарныйСчетВПаевомИнвестиционномФондеДляОбмена.Видимость			= ЭтоЗаявкаНаОбмен;
	
	Элементы.РеквизитыПлатежа.Видимость = Не ЭтоЗаявкаНаОбмен;
	
	Элементы.ДепозитарныйСчетВПаевомИнвестиционномФондеДляОбмена.Доступность				= Не Объект.ОткрытьДепозитарныйСчетВПаевомИнвестиционномФондеДляОбмена;
	Элементы.ДепозитарныйСчетВПаевомИнвестиционномФондеДляОбмена.АвтоОтметкаНезаполненного	= Не Объект.ОткрытьДепозитарныйСчетВПаевомИнвестиционномФондеДляОбмена;
	
	ОбязательностьСуммы = Не Объект.Многократная;
	
	Элементы.Сумма.ОтметкаНезаполненного = Ложь;
	Элементы.Сумма.АвтоОтметкаНезаполненного = ОбязательностьСуммы;
	Элементы.Сумма.Доступность = ОбязательностьСуммы;
	
	Элементы.ГруппаУсловияЗаявкиНаЗачисление.Видимость = Ложь;	
	Элементы.ГруппаУсловияЗаявкиНаПогашениеИОбмен.Видимость = Ложь;	
	
	Элементы.ДепозитарныйСчет.ОтметкаНезаполненного = Ложь;
	Если Объект.ВидЗаявки = ПредопределенноеЗначение("Перечисление.ВидыЗаявокПайщиков.Зачисление") Тогда
		Элементы.ГруппаУсловияЗаявкиНаЗачисление.Видимость = Истина;
		Элементы.ОткрытьЗакрытьДепозитарныйСчет.Заголовок = "Открыть депозитарный (лицевой) счет";
		Элементы.ОткрытьЗакрытьДепозитарныйСчет.Подсказка = "Отправить заявление на открытие лицевого счета пайщика в спец. депозитарий";
		Элементы.ДепозитарныйСчет.Доступность      	     = Не Объект.ОткрытьЗакрытьДепозитарныйСчет;
		Элементы.ДепозитарныйСчет.АвтоОтметкаНезаполненного = Не Объект.ОткрытьЗакрытьДепозитарныйСчет;
	ИначеЕсли Объект.ВидЗаявки = ПредопределенноеЗначение("Перечисление.ВидыЗаявокПайщиков.Погашение") Тогда
		Элементы.ГруппаУсловияЗаявкиНаПогашениеИОбмен.Видимость = Истина;	
		Элементы.ОткрытьЗакрытьДепозитарныйСчет.Заголовок = "Закрыть депозитарный (лицевой) счет";
		Элементы.ОткрытьЗакрытьДепозитарныйСчет.Подсказка = "Отправить заявление на закрытие лицевого счета пайщика в спец. депозитарий";
		Элементы.ДепозитарныйСчет.Доступность      	     = Истина;
		Элементы.ДепозитарныйСчет.АвтоОтметкаНезаполненного = Истина;
	Иначе
		Элементы.ГруппаУсловияЗаявкиНаПогашениеИОбмен.Видимость = Истина;
		Элементы.ОткрытьЗакрытьДепозитарныйСчет.Видимость		= Ложь;
		Элементы.ДепозитарныйСчет.Доступность      	     		= Истина;
		Элементы.ДепозитарныйСчет.АвтоОтметкаНезаполненного 	= Истина;
	КонецЕсли;
	
	// Пока заполняем только автоматически
	Элементы.ЗаявкаНаОбмен.Видимость = ЗначениеЗаполнено(Объект.ЗаявкаНаОбмен);
	
	Элементы.ВыгружатьОперацииВЕСИАФинанс.ТолькоПросмотр = Не РаботаСПользователями.ЭтоПолноправныйПользователь();

	Если Форма.Модифицированность Тогда
		
		ПутьКДаннымСкрываемыхПолей = Новый Структура();						
		ПутьКДаннымСкрываемыхПолей.Вставить("ПаевойИнвестиционныйФондДляОбменаПаев",	"Объект.ПаевойИнвестиционныйФондДляОбменаПаев");
		ПутьКДаннымСкрываемыхПолей.Вставить("ГруппаУсловияЗаявкиНаЗачисление",			"Объект.Сумма");
		ПутьКДаннымСкрываемыхПолей.Вставить("Количество",								"Объект.Количество");
		ПутьКДаннымСкрываемыхПолей.Вставить("Агент",									"Объект.Агент");
		ПутьКДаннымСкрываемыхПолей.Вставить("ФИОАгента",								"Объект.ФИОАгента");
		ПутьКДаннымСкрываемыхПолей.Вставить("ДолжностьАгента",							"Объект.ДолжностьАгента");
		
		РаботаСФормамиКлиентСервер.ОчиститьЗначенияСкрытыхПолей(Форма, ПутьКДаннымСкрываемыхПолей);	
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступныеВидыПайщиков(Объект, Форма)
	
	Элементы = Форма.Элементы;
	
	СписокДоступныхВидовПайщиков = ПолучитьДанныеВыбора(Тип("ПеречислениеСсылка.ВидыПайщиков"), Новый Структура("ИсточникАнкетИЗаявок", Объект.ИсточникЗаявки));
	
	СписокВыбора = Элементы.ВидПайщика.СписокВыбора;
	СписокВыбора.Очистить();

	Для каждого ЭлементСписка из СписокДоступныхВидовПайщиков Цикл
		СписокВыбора.Добавить(ЭлементСписка.Значение.Значение, ЭлементСписка.Представление);	
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьДоступныеВидыСобственности(Объект, Форма)
	
	Элементы = Форма.Элементы;
	
	СписокДоступныхВидовСобственности = ПолучитьДанныеВыбора(Тип("ПеречислениеСсылка.ВидыСобственности"), Новый Структура("ИсточникАнкетИЗаявок", Объект.ИсточникЗаявки));
	
	СписокВыбора = Элементы.СобственностьНаПаи.СписокВыбора;
	СписокВыбора.Очистить();

	Для каждого ЭлементСписка из СписокДоступныхВидовСобственности Цикл
		СписокВыбора.Добавить(ЭлементСписка.Значение.Значение, ЭлементСписка.Представление);	
	КонецЦикла;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ЗаполнитьРеквизитыПлатежа(Объект, Форма)
	
	ТекстРеквизитов = "";

	Если Объект.ВидЗаявки <> ПредопределенноеЗначение("Перечисление.ВидыЗаявокПайщиков.Обмен") Тогда
		
		ТекстРеквизитов = ТекстРеквизитов 
		+ "Получатель: " + ?(ПустаяСтрока(Объект.ПолучательПлатежа), "<Не указан>", Объект.ПолучательПлатежа) + Символы.ПС
		+ "Банк " + ?(ПустаяСтрока(Объект.БИК), "<Не указан>", Объект.НаименованиеБанка) + Символы.ПС
		+ "БИК " + ?(ПустаяСтрока(Объект.БИК), "<Не указан>", Объект.БИК)
		+ ?(ПустаяСтрока(Объект.БИК), "", " к/с "  + Объект.КоррСчет) + Символы.ПС
		+ "р/с "  + ?(ПустаяСтрока(Объект.БИК), "<Не указан>", Объект.НомерСчета) + Символы.ПС;
		
		Если ЗначениеЗаполнено(Объект.ЛицевойСчет) Тогда
			ТекстРеквизитов = ТекстРеквизитов 
			+ "л/с " + Объект.ЛицевойСчет + Символы.ПС;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.ИННПолучателя) Тогда
			ТекстРеквизитов = ТекстРеквизитов 
			+ "ИНН: " + Объект.ИННПолучателя + Символы.ПС;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Объект.НазначениеПлатежа) Тогда
			ТекстРеквизитов = ТекстРеквизитов 
			+ "Назначение платежа: " + Объект.НазначениеПлатежа;
		КонецЕсли;
		
	КонецЕсли;
	
	Форма.РеквизитыПлатежа = ТекстРеквизитов;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьВидимостьРеквизитовУчастников(Элементы, ЮрФизЛицо, НомерУчастникаСтрока)
	
	ВидЮрФизЛица = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ЮрФизЛицо, "ВидЮрФизЛица");
	Элементы["ВЛице" + НомерУчастникаСтрока].Видимость = (ВидЮрФизЛица = ПредопределенноеЗначение("Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо"));
	Элементы["ОснованиеПолномочийВЛице" + НомерУчастникаСтрока].Видимость = (ВидЮрФизЛица = ПредопределенноеЗначение("Перечисление.ВидыЮрФизЛиц.ЮридическоеЛицо"));
	
КонецПроцедуры

#КонецОбласти

#Область События_элементов_формы

&НаКлиенте
Процедура ИсточникЗаявкиПриИзменении(Элемент)
	
	УстановитьДоступныеВидыПайщиков(Объект, ЭтотОбъект);
	
	Если Элементы.ВидПайщика.СписокВыбора.НайтиПоЗначению(Объект.ВидПайщика) = Неопределено Тогда
		Объект.ВидПайщика = Элементы.ВидПайщика.СписокВыбора.Получить(0).Значение;	
	КонецЕсли;
	
	УстановитьДоступныеВидыСобственности(Объект, ЭтотОбъект);
	
	Если Элементы.СобственностьНаПаи.СписокВыбора.НайтиПоЗначению(Объект.СобственностьНаПаи) = Неопределено Тогда
		Объект.СобственностьНаПаи = Элементы.СобственностьНаПаи.СписокВыбора.Получить(0).Значение;	
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(Объект, ЭтотОбъект);
		
КонецПроцедуры

&НаКлиенте
Процедура ВидПайщикаПриИзменении(Элемент)
	
	ОбработатьИзменениеПайщикаИлиВидаПайщика();
	
КонецПроцедуры

&НаКлиенте
Процедура ПайщикПриИзменении(Элемент)
	
	ОбработатьИзменениеПайщикаИлиВидаПайщика();
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	
	ОбработатьИзменениеВладельца();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	
	Объект.Дата = РаботаСДокументами.ПолучитьВремяДокумента(Объект.Дата, Объект.Ссылка);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПоляПлатежаЮрФизЛица(Знач ЮрФизЛицо, Знач Организация, Знач Дата)
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеквизитыФизическихЛицАнкетныеСрезПоследних.ИНН КАК ИННПолучателя,
	|	РеквизитыФизическихЛицАнкетныеСрезПоследних.Фамилия + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Имя + "" "" + РеквизитыФизическихЛицАнкетныеСрезПоследних.Отчество КАК ПолучательПлатежа
	|ИЗ
	|	РегистрСведений.РеквизитыФизическихЛицАнкетные.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ЮрФизЛицо = &ЮрФизЛицо
	|				И Язык = &Язык) КАК РеквизитыФизическихЛицАнкетныеСрезПоследних
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ИНН,
	|	РеквизитыЮридическихЛицАнкетныеСрезПоследних.ПолноеНаименованиеПоУставу
	|ИЗ
	|	РегистрСведений.РеквизитыЮридическихЛицАнкетные.СрезПоследних(
	|			&Период,
	|			Организация = &Организация
	|				И ЮрФизЛицо = &ЮрФизЛицо
	|				И Язык = &Язык) КАК РеквизитыЮридическихЛицАнкетныеСрезПоследних");
	
	Запрос.УстановитьПараметр("Период", Дата);
	Запрос.УстановитьПараметр("ЮрФизЛицо", ЮрФизЛицо);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("Язык", Справочники.Языки.Русский);
	
	ЗначенияПолей = Новый Структура("ИННПолучателя, ПолучательПлатежа");
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(ЗначенияПолей, Выборка);
	КонецЕсли;
	
	Возврат ЗначенияПолей;
	
КонецФункции

&НаКлиенте
Процедура ОбработатьИзменениеПайщикаИлиВидаПайщика()
	
	Если Объект.ВидПайщика = ПредопределенноеЗначение("Перечисление.ВидыПайщиков.Владелец") Тогда
		Если Объект.Владелец <> Объект.Пайщик Тогда
			Объект.РасчетныйСчет = Неопределено;	
			Объект.Владелец      = Объект.Пайщик;
		КонецЕсли;
	КонецЕсли;
	
	ОбработатьИзменениеВладельца();
	
	ЗаполнитьРеквизитыПлатежа(Объект, ЭтотОбъект);
	
	НастроитьВидимостьИДоступность(Объект, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьИзменениеВладельца()
	
	РеквизитыБанковскогоСчета = ПолучитьПоследниеБанковскиеРеквизиты(Объект.Организация, Объект.Владелец, КонецДня(Объект.Дата));
	ЗаполнитьЗначенияСвойств(Объект, РеквизитыБанковскогоСчета);
	
	Если Не ЗначениеЗаполнено(РеквизитыБанковскогоСчета.РасчетныйСчет) Тогда
		
		ПоляПлатежа = ПолучитьПоляПлатежаЮрФизЛица(Объект.Владелец, Объект.Организация, Объект.Дата);
		
		Объект.ИННПолучателя = ПоляПлатежа.ИННПолучателя;
		Объект.ПолучательПлатежа = ПоляПлатежа.ПолучательПлатежа;
		
	КонецЕсли;
	
	ЗаполнитьРеквизитыПлатежа(Объект, ЭтотОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПоследниеБанковскиеРеквизиты(Знач Организация, Знач ЮрФизЛицо, Период)
	
	Возврат Справочники.БанковскиеСчета.ПолучитьРеквизитыПлатежа(Организация, ЮрФизЛицо, , Период);
	
КонецФункции

&НаКлиенте
Процедура МногократнаяПриИзменении(Элемент)
	
	Если Не Объект.Многократная Тогда
		Объект.Сумма = 0;
	Иначе
		Объект.Имущество.Очистить();
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(Объект, ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидЗаявкиПриИзменении(Элемент)
	
	Если Объект.ВидЗаявки = ПредопределенноеЗначение("Перечисление.ВидыЗаявокПайщиков.Зачисление") Тогда
		Если Объект.ОткрытьЗакрытьДепозитарныйСчет Тогда
			Объект.ДепозитарныйСчет = Неопределено;
		КонецЕсли;
	Иначе
		Объект.Имущество.Очистить();
		Объект.Многократная = Ложь;
	КонецЕсли;
	
	ЗаполнитьРеквизитыПлатежа(Объект, ЭтотОбъект);
	
	НастроитьВидимостьИДоступность(Объект, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗакрытьЛицевойСчетПриИзменении(Элемент)
	
	Если Объект.ВидЗаявки = ПредопределенноеЗначение("Перечисление.ВидыЗаявокПайщиков.Зачисление") Тогда
		Если Объект.ОткрытьЗакрытьДепозитарныйСчет Тогда
			Объект.ДепозитарныйСчет = Неопределено;
		КонецЕсли;
	КонецЕсли;
	
	НастроитьВидимостьИДоступность(Объект, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура БрокерыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Документ.ЗаявкаПайщика.Форма.ФормаСпискаНоминальныхДержателей", Новый Структура("НоминальныеДержатели", Объект.НоминальныеДержатели), Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура РеквизитыПлатежаНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РеквизитыПлатежаСтруктура = Новый Структура("БИК, НаименованиеБанка, КоррСчет, РасчетныйСчет, НомерСчета, ПолучательПлатежа, ИННПолучателя, ЛицевойСчет, НазначениеПлатежа, СозданДокументом");
	ЗаполнитьЗначенияСвойств(РеквизитыПлатежаСтруктура, Объект);
	
	ПараметрыОтбора = Новый Структура;
	ПараметрыОтбора.Вставить("РеквизитыПлатежа"	, РеквизитыПлатежаСтруктура);
	ПараметрыОтбора.Вставить("ТолькоПросмотр"	, ЭтаФорма.ТолькоПросмотр);
	ПараметрыОтбора.Вставить("Организация"		, Объект.Организация);
	ПараметрыОтбора.Вставить("Дата"				, Объект.Дата);
	ПараметрыОтбора.Вставить("ЮрФизЛицо"		, Объект.Владелец);
	
	ОткрытьФорму("Документ.ЗаявкаПайщика.Форма.ФормаРеквизитовПлатежа", ПараметрыОтбора, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмуществоВидИмуществаПриИзменении(Элемент)
	
	ТД = Элементы.Имущество.ТекущиеДанные;
	
	Если ТД.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыАктивов.Недвижимость") Тогда
		ТД.Количество = 1;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ИмуществоИмуществоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Имущество.ТекущиеДанные;
	
	ТекущиеДанные.Сумма = ПолучитьСтоимостьИмущества(ТекущиеДанные.ВидИмущества, ТекущиеДанные.Имущество);
	
КонецПроцедуры

&НаКлиенте
Процедура ИмуществоПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока Тогда
		Элемент.ТекущиеДанные.ВидИмущества = ПредопределенноеЗначение("Перечисление.ВидыАктивов.Недвижимость");
	КонецЕсли;
	
	ИмуществоВидИмуществаПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьДепозитарныйСчетВПаевомИнвестиционномФондеДляОбменаПриИзменении(Элемент)
	
	НастроитьВидимостьИДоступность(Объект, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область Обработчики_событий_участников

&НаКлиенте
Процедура ДобавитьУчастника(Команда)
	
	НоваяСтрока = Объект.Представители.Добавить();
	РазместитьУчастникаНаСервере(НоваяСтрока.НомерСтроки - 1);
	УстановитьВидимостьРеквизитовУчастников(Элементы, Объект.Представители[НоваяСтрока.НомерСтроки - 1].Представитель, Формат(НоваяСтрока.НомерСтроки - 1, "ЧН=0; ЧГ="));
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьУчастника(Элемент)
	
	Модифицированность = Истина;
	
	НомерУчастникаСтрока = Сред(Элемент.Имя, СтрДлина("ДекорацияУдаления") + 1);
	НомерУчастникаЧисло  = Число(НомерУчастникаСтрока);
	
	УдалитьУчастникаНаСервере();
	
	Объект.Представители.Удалить(НомерУчастникаЧисло);
	
	Для Сч = НомерУчастникаЧисло по Объект.Представители.Количество() - 1 Цикл
		УстановитьВидимостьРеквизитовУчастников(Элементы, Объект.Представители[Сч].Представитель, Формат(Сч, "ЧН=0; ЧГ="));	
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РазместитьУчастникаНаСервере(Знач ИндексЭлемента)
	
	НомерУчастникаСтрока = Формат(ИндексЭлемента, "ЧН=0; ЧГ=0");
	
	НоваяГруппа = Элементы.Добавить("ГруппаУчастник" + НомерУчастникаСтрока, Тип("ГруппаФормы"), Элементы.ГруппаУчастники);
	НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	НоваяГруппа.ОтображатьЗаголовок = Ложь;
	НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Горизонтальная;
	НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
	
	НовыйЭлемент = Элементы.Добавить("ДекорацияУдаления" + НомерУчастникаСтрока, Тип("ДекорацияФормы"), НоваяГруппа);
	НовыйЭлемент.Подсказка = "Удалить участника";
	НовыйЭлемент.Вид       = ВидДекорацииФормы.Картинка;
	НовыйЭлемент.Картинка  = БиблиотекаКартинок.Удалить;
	НовыйЭлемент.Гиперссылка = Истина;
	НовыйЭлемент.Доступность = Не ТолькоПросмотр;
	НовыйЭлемент.РастягиватьПоВертикали = Ложь;
	НовыйЭлемент.УстановитьДействие("Нажатие", "УдалитьУчастника");
	
	НовыйЭлемент = Элементы.Добавить("Представитель" + НомерУчастникаСтрока, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.ПутьКДанным = "Объект.Представители[" + НомерУчастникаСтрока + "].Представитель";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Верх;
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
	НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	НовыйЭлемент.УстановитьДействие("ПриИзменении", "ПредставительПриИзменении");
	НовыйЭлемент.Ширина = 30;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("ОснованиеПолномочий" + НомерУчастникаСтрока, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.ПутьКДанным = "Объект.Представители[" + НомерУчастникаСтрока + "].ОснованиеПолномочий";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
	НовыйЭлемент.ПодсказкаВвода = "Основание полномочий";
	НовыйЭлемент.Ширина = 40;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	
	НовыйЭлемент = Элементы.Добавить("ВЛице" + НомерУчастникаСтрока, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.ПутьКДанным = "Объект.Представители[" + НомерУчастникаСтрока + "].ВЛице";
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Видимость = Ложь;
	НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
	НовыйЭлемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
	НовыйЭлемент.Ширина = 30;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;

	НовыйЭлемент = Элементы.Добавить("ОснованиеПолномочийВЛице" + НомерУчастникаСтрока, Тип("ПолеФормы"), НоваяГруппа);
	НовыйЭлемент.ПутьКДанным = "Объект.Представители[" + НомерУчастникаСтрока + "].ОснованиеПолномочийВЛице";
	НовыйЭлемент.ПоложениеЗаголовка = ПоложениеЗаголовкаЭлементаФормы.Нет;
	НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
	НовыйЭлемент.Видимость = Ложь;
	НовыйЭлемент.АвтоОтметкаНезаполненного = Истина;
	НовыйЭлемент.ПодсказкаВвода = "Основание полномочий";
	НовыйЭлемент.Ширина = 40;
	НовыйЭлемент.РастягиватьПоГоризонтали = Ложь;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьУчастникаНаСервере()
	
	НомерУчастника = Объект.Представители.Количество() - 1;
	НомерУчастникаСтрока = Формат(НомерУчастника, "ЧН=0; ЧГ=0");
	Элементы.Удалить(Элементы["ГруппаУчастник" + НомерУчастникаСтрока]);
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставительПриИзменении(Элемент)
	
	НомерУчастникаСтрокой = СтрЗаменить(Элемент.Имя, "Представитель", "");
	НомерУчастникаЧислом  = Число(НомерУчастникаСтрокой);
	
	УстановитьВидимостьРеквизитовУчастников(Элементы, Объект.Представители[НомерУчастникаЧислом].Представитель, НомерУчастникаСтрокой);
	
КонецПроцедуры

#КонецОбласти

#Область Прочие_процедуры_и_функции

&НаСервере
Функция ПолучитьСтоимостьИмущества(ВидИмущества, Имущество)
	
	СведенияОбОценке = РегистрыСведений.ОценкиСтоимостиПрочихАктивов.ПолучитьПоследнее(
		Объект.Дата, 
		Новый Структура("Организация,СчетДоверительногоУправления,ВидАктива,Основание,СубъектАналитики",
	        Объект.Организация, 
			Справочники.СчетаДоверительногоУправления.СчетДоверительногоУправленияКлиента(Объект.ПаевойИнвестиционныйФонд, Объект.Дата), 
			ВидИмущества, 
			Неопределено, 
			Имущество)
		);
	
	Если СведенияОбОценке.ДатаОкончанияДействия >= НачалоДня(Объект.Дата) Тогда
		Возврат СведенияОбОценке.Стоимость;
	Иначе
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не найдена цена оценщика для объекта имущества " + Имущество);
		Возврат 0;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура Подключаемый_ОткрытьПрисоединенныеФайлы()

	РаботаСФайловымХранилищемКлиент.ОткрытьПрисоединенныеФайлы(Объект.Ссылка);

КонецПроцедуры

#КонецОбласти
